**In pandas you can add/append a new column to the existing DataFrame using DataFrame.insert() method, this method updates the existing DataFrame with a new column. DataFrame.assign() is also used to insert a new column however, this method returns a new Dataframe after adding a new column.**

### 1. Quick Examples of Add Column to DataFrame

**Let’s create a Pandas DataFrame with sample data and execute the above examples.**

In [2]:
import pandas as pd
import numpy as np

technologies= {
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas"],
    'Fee' :[22000,25000,23000,24000,26000],
    'Discount':[1000,2300,1000,1200,2500]
          }

df = pd.DataFrame(technologies)
print(df)

   Courses    Fee  Discount
0    Spark  22000      1000
1  PySpark  25000      2300
2   Hadoop  23000      1000
3   Python  24000      1200
4   Pandas  26000      2500

#### 2. Pandas Add Column to DataFrame

DataFrame.assign() is used to add/append a column to the Pandas DataFrame, this method returns a new DataFrame after adding a column to the existing DataFrame.

Below is the syntax of the assign() method.


#### Syntax of DataFrame.assign():

    DataFrame.assign(**kwargs)

Now let’s add a column ‘TutorsAssigned” to the DataFrame. Using assign() we cannot modify the existing DataFrame in-place instead it returns a new DataFrame after adding a column. The below example adds a list of values as a new column to the DataFrame.

In [10]:
# Add new column to the DataFrame

names = ['Rohan','Sohan','Mohan','Ram','Shyam']

df1 = df.assign(Name=names)
df1

   Courses    Fee  Discount   Name
0    Spark  22000      1000  Rohan
1  PySpark  25000      2300  Sohan
2   Hadoop  23000      1000  Mohan
3   Python  24000      1200    Ram
4   Pandas  26000      2500  Shyam

### 3. Add Multiple Columns to the DataFrame

You can also use assign() method to add multiple columns to the pandas DataFrame

In [12]:
# Add multiple columns to the DataFrame

df2 = df.assign(Companies= ['TATA','HCL','Infosys','Google','Amazon'], Name = names)
df2

   Courses    Fee  Discount Companies   Name
0    Spark  22000      1000      TATA  Rohan
1  PySpark  25000      2300       HCL  Sohan
2   Hadoop  23000      1000   Infosys  Mohan
3   Python  24000      1200    Google    Ram
4   Pandas  26000      2500    Amazon  Shyam

### 4. Adding a Column From Existing

In real-time, we are mostly required to add a column by calculating from an existing column. The below example derives Discount_Percent column from Fee and Discount. Here, I will use lambda to derive a new column from the existing one.

In [15]:
# Derive New Column from Existing Column
df = pd.DataFrame(technologies)
df2 = df.assign(UpdatedFee=df.Fee+1000)
print(df2)

   Courses    Fee  Discount  UpdatedFee
0    Spark  22000      1000       23000
1  PySpark  25000      2300       26000
2   Hadoop  23000      1000       24000
3   Python  24000      1200       25000
4   Pandas  26000      2500       27000

### 5. Add a Constant or Empty Column

The below example adds 3 new columns to the DataFrame, one column with all None values, a second column with 0 value, and the third column with an empty string value.

In [21]:
import numpy

# Add a constant or empty value to the DataFrame.
df3 = df.assign(New=None, New1="", New2=0, Region="North",Zone=1, Missing=numpy.NaN)
df3

   Courses    Fee  Discount   New New1  New2 Region  Zone  Missing
0    Spark  22000      1000  None          0  North     1      NaN
1  PySpark  25000      2300  None          0  North     1      NaN
2   Hadoop  23000      1000  None          0  North     1      NaN
3   Python  24000      1200  None          0  North     1      NaN
4   Pandas  26000      2500  None          0  North     1      NaN

### 6. Append Column to Existing Pandas DataFrame

The above examples create a new DataFrame after adding new columns instead of appending a column to an existing DataFrame. The example explained in this section is used to append a new column to the existing DataFrame.

In [24]:
# Add New column to the existing DataFrame
df['Region'] = ["North","South","South","North","South"]
df

   Courses    Fee  Discount Region
0    Spark  22000      1000  North
1  PySpark  25000      2300  South
2   Hadoop  23000      1000  South
3   Python  24000      1200  North
4   Pandas  26000      2500  South

In [25]:
# Add New column to the existing DataFrame
df['Region'] = "North"
df

   Courses    Fee  Discount Region
0    Spark  22000      1000  North
1  PySpark  25000      2300  North
2   Hadoop  23000      1000  North
3   Python  24000      1200  North
4   Pandas  26000      2500  North

**You can also use this approach to add a new column by deriving from an existing column,**

In [28]:
# Derive a new column from existing column
df['Discount_Percent'] = (df['Discount']) / df['Fee'] *100
df

   Courses    Fee  Discount Region  Discount_Percent
0    Spark  22000      1000  North          4.545455
1  PySpark  25000      2300  North          9.200000
2   Hadoop  23000      1000  North          4.347826
3   Python  24000      1200  North          5.000000
4   Pandas  26000      2500  North          9.615385

### 7. Add Column to Specific Position of DataFrame

DataFrame.insert() method is used to add DataFrame at any position of the existing DataFrame. In most of the above examples you have seen inserts at the end of the DataFrame but this method gives the flexibility to add it at the beginning, in the middle, or at any column index of the DataFrame.

This example adds a Tutors column at the beginning of the DataFrame.

In [30]:
# Add new column at the specific position
df = pd.DataFrame(technologies)
df.insert(2,'Tutors', [1,2,3,4,5] )
print(df)

   Courses    Fee  Tutors  Discount
0    Spark  22000       1      1000
1  PySpark  25000       2      2300
2   Hadoop  23000       3      1000
3   Python  24000       4      1200
4   Pandas  26000       5      2500